Repository: wasimmostakim2965-ui/openclaw-windows-node
Catalog: src/OpenClaw.Tray.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, pt_br, zh_cn, zh_tw

# ConnectionPage_NodeActiveCapabilities
source: Node active · {0} capabilities
fr_fr: Nœud actif · {0} capacités
pt_br: Node ativo · {0} recursos
zh_cn: 节点活动 · {0} 项能力
zh_tw: 節點使用中 · {0} 項功能

# ConnectionPage_NodeActiveOneCapability
source: Node active · 1 capability
fr_fr: Nœud actif · 1 capacité
pt_br: Node ativo · 1 recurso
zh_cn: 节点活动 · 1 项能力
zh_tw: 節點使用中 · 1 項功能

# ConnectionPage_NodeActiveNoCapabilities
source: Node active · no capabilities enabled
fr_fr: Nœud actif · aucune capacité activée
pt_br: Node ativo · nenhum recurso ativado
zh_cn: 节点活动 · 无已启用的能力
zh_tw: 節點使用中 · 未啟用任何功能

# ConnectionPage_NodeAwaitingPairing
source: Awaiting pairing approval
fr_fr: En attente d’approbation de l’appairage
pt_br: Aguardando aprovação do pareamento
zh_cn: 等待配对审批
zh_tw: 等待配對核准

# ConnectionPage_NodePairingRejected
source: Pairing rejected
fr_fr: Appairage refusé
pt_br: Pareamento rejeitado
zh_cn: 配对被拒绝
zh_tw: 配對遭拒

# ConnectionPage_NodeRateLimited
source: Rate-limited
fr_fr: Limité en débit
pt_br: Limitação de solicitações
zh_cn: 已限流
zh_tw: 已限流

# ConnectionPage_NodeError
source: Node error
fr_fr: Erreur du nœud
pt_br: Erro do Node
zh_cn: 节点错误
zh_tw: 節點錯誤

# ConnectionPage_NodeModeDisabledText
source: Node mode disabled
fr_fr: Mode nœud désactivé
pt_br: Modo Node desativado
zh_cn: 节点模式已禁用
zh_tw: 節點模式已停用

# ConnectionPage_NodeStarting
source: Node starting…
fr_fr: Node en cours de démarrage…
pt_br: Iniciando o Node…
zh_cn: Node 正在启动…
zh_tw: Node 正在啟動…

# ConnectionPage_NodeMcpOnly
source: Serving capabilities locally (MCP only)
fr_fr: Capacités fournies localement (MCP uniquement)
pt_br: Disponibilizando recursos localmente (somente MCP)
zh_cn: 正在本地提供功能（仅 MCP）
zh_tw: 正在本機提供功能（僅 MCP）

# ConnectionPage_NodeMcpOnlyReachable
source: Reachable by local MCP clients at {0}
fr_fr: Accessible par les clients MCP locaux à {0}
pt_br: Acessível por clientes MCP locais em {0}
zh_cn: 本地 MCP 客户端可通过 {0} 访问
zh_tw: 本機 MCP 用戶端可透過 {0} 存取

# ConnectionPage_NodeMcpError
source: Local MCP server failed to start
fr_fr: Échec du démarrage du serveur MCP local
pt_br: Falha ao iniciar o servidor MCP local
zh_cn: 本地 MCP 服务器启动失败
zh_tw: 本機 MCP 伺服器啟動失敗

# ConnectionPage_NodeBodyNoCapabilities
source: No capabilities enabled. Pick what to share in Permissions.
fr_fr: Aucune capacité activée. Choisissez ce que vous souhaitez partager dans les Autorisations.
pt_br: Nenhum recurso ativado. Escolha o que compartilhar em Permissões.
zh_cn: 未启用任何能力。请在权限中选择要共享的内容。
zh_tw: 未啟用任何功能。請在權限中選擇要共用的內容。

# ConnectionPage_NodeBodyAwaitingApproval
source: Awaiting approval on the gateway host.
fr_fr: En attente d’approbation sur l’hôte de la passerelle.
pt_br: Aguardando aprovação no host do Gateway.
zh_cn: 等待网关主机上的审批。
zh_tw: 等待閘道主機上的核准。

# ConnectionPage_NodeBodyPairingRejected
source: Pairing was rejected. Re-pair from Add Gateway.
fr_fr: L’appairage a été refusé. Réappairez depuis Ajouter une passerelle.
pt_br: O pareamento foi rejeitado. Faça o pareamento novamente em Adicionar Gateway.
zh_cn: 配对被拒绝。请从添加网关重新配对。
zh_tw: 配對遭拒。請從新增閘道重新配對。

# ConnectionPage_NodeBodyRateLimited
source: Rate-limited by the gateway. Will retry after cooldown.
fr_fr: Limité en débit par la passerelle. Nouvel essai après refroidissement.
pt_br: Limitado por taxa pelo Gateway. Tentará novamente após o período de espera.
zh_cn: 被网关限流。将在冷却后重试。
zh_tw: 被閘道限流。將在冷卻後重試。

# ConnectionPage_NodeBodyError
source: Node reported an error.
fr_fr: Le nœud a signalé une erreur.
pt_br: O Node informou um erro.
zh_cn: 节点报告了一个错误。
zh_tw: 節點回報了一個錯誤。

# ConnectionPage_ProvidingNoCapabilities
source: Providing no capabilities
fr_fr: Aucune capacité fournie
pt_br: Nenhum recurso disponibilizado
zh_cn: 未提供任何能力
zh_tw: 未提供任何功能

# ConnectionPage_ProvidingCapabilitiesSingular
source: Providing 1 capability: {0}
fr_fr: 1 capacité fournie : {0}
pt_br: Disponibilizando 1 recurso: {0}
zh_cn: 提供 1 项能力：{0}
zh_tw: 提供 1 項功能：{0}

# ConnectionPage_ProvidingCapabilitiesPlural
source: Providing {0} capabilities: {1}
fr_fr: {0} capacités fournies : {1}
pt_br: Disponibilizando {0} recursos: {1}
zh_cn: 提供 {0} 项能力：{1}
zh_tw: 提供 {0} 項功能：{1}

# ConnectionPage_BadgeConnected
source: Connected
fr_fr: Connecté
pt_br: Conectado
zh_cn: 已连接
zh_tw: 已連線

# ConnectionPage_BadgeConnecting
source: Connecting…
fr_fr: Connexion en cours…
pt_br: Conectando…
zh_cn: 正在连接…
zh_tw: 連線中…

# ConnectionPage_BadgeAwaitingApproval
source: Awaiting approval
fr_fr: En attente d’approbation
pt_br: Aguardando aprovação
zh_cn: 等待审批
zh_tw: 等待核准

# ConnectionPage_BadgeDisconnecting
source: Disconnecting…
fr_fr: Déconnexion en cours…
pt_br: Desconectando…
zh_cn: 正在断开连接…
zh_tw: 正在中斷連線…

# ConnectionPage_ConnectAction
source: Connect
fr_fr: Connecter
pt_br: Conectar
zh_cn: 连接
zh_tw: 連線

# ConnectionPage_OpenDashboard
source: Open dashboard
fr_fr: Ouvrir le tableau de bord
pt_br: Abrir painel
zh_cn: 打开仪表板
zh_tw: 開啟儀表板

# ConnectionPage_GatewayOptionsA11y
source: Options for {0}
fr_fr: Options pour {0}
pt_br: Opções de {0}
zh_cn: {0} 的选项
zh_tw: {0} 的選項

# ConnectionPage_DisconnectAction
source: Disconnect
fr_fr: Déconnecter
pt_br: Desconectar
zh_cn: 断开连接
zh_tw: 中斷連線

# ConnectionPage_Edit
source: Edit
fr_fr: Modifier
pt_br: Editar
zh_cn: 编辑
zh_tw: 編輯

# ConnectionPage_Remove
source: Remove
fr_fr: Supprimer
pt_br: Remover
zh_cn: 移除
zh_tw: 移除

# ConnectionPage_ViaSSH
source: via SSH
zh_cn: 通过 SSH
zh_tw: 透過 SSH

# ConnectionPage_SavedGatewaysSingular
source: Saved gateways (1)
fr_fr: Passerelles enregistrées (1)
pt_br: Gateways salvos (1)
zh_cn: 已保存的网关 (1)
zh_tw: 已儲存的閘道 (1)

# ConnectionPage_SavedGatewaysPlural
source: Saved gateways ({0})
fr_fr: Passerelles enregistrées ({0})
pt_br: Gateways salvos ({0})
zh_cn: 已保存的网关 ({0})
zh_tw: 已儲存的閘道 ({0})

# ConnectionPage_JustNow
source: just now
fr_fr: à l’instant
pt_br: agora mesmo
zh_cn: 刚刚
zh_tw: 剛才

# ConnectionPage_MinutesAgo
source: {0}m ago
fr_fr: il y a {0} min
pt_br: há {0}min
zh_cn: {0}分钟前
zh_tw: {0}分鐘前

# ConnectionPage_HoursAgo
source: {0}h ago
fr_fr: il y a {0} h
pt_br: há {0}h
zh_cn: {0}小时前
zh_tw: {0}小時前

# ConnectionPage_DaysAgo
source: {0}d ago
fr_fr: il y a {0} j
pt_br: há {0}d
zh_cn: {0}天前
zh_tw: {0}天前

# ConnectionPage_MonthsAgo
source: {0}mo ago
fr_fr: il y a {0} mois
pt_br: há {0}m
zh_cn: {0}个月前
zh_tw: {0}個月前

# ConnectionPage_YearsAgo
source: {0}y ago
fr_fr: il y a {0} an(s)
pt_br: há {0}a
zh_cn: {0}年前
zh_tw: {0}年前

# ConnectionPage_RecoveryHeaderAuth
source: Re-pair this gateway:
fr_fr: Réappairer cette passerelle :
pt_br: Reparear este Gateway:
zh_cn: 重新配对此网关：
zh_tw: 重新配對此閘道：

# ConnectionPage_RecoveryHeaderPairing
source: Awaiting approval:
fr_fr: En attente d’approbation :
pt_br: Aguardando aprovação:
zh_cn: 等待审批：
zh_tw: 等待核准：

# ConnectionPage_RecoveryHeaderTunnel
source: Help us fix the SSH tunnel:
fr_fr: Aidez-nous à réparer le tunnel SSH :
pt_br: Ajude-nos a corrigir o túnel SSH:
zh_cn: 帮助我们修复 SSH 隧道：
zh_tw: 協助我們修復 SSH 通道：

# ConnectionPage_RecoveryHeaderServer
source: Help us fix this connection:
fr_fr: Aidez-nous à réparer cette connexion :
pt_br: Ajude-nos a corrigir esta conexão:
zh_cn: 帮助我们修复此连接：
zh_tw: 協助我們修復此連線：

# ConnectionPage_RecoveryAuthBullet1
source: Get a fresh setup code from the gateway host.
fr_fr: Obtenez un nouveau code de configuration auprès de l’hôte de la passerelle.
pt_br: Obtenha um novo código de configuração no host do Gateway.
zh_cn: 从网关主机获取新的设置代码。
zh_tw: 從閘道主機取得新的設定碼。

# ConnectionPage_RecoveryAuthBullet2
source: Or paste a new direct token below.
fr_fr: Ou collez un nouveau jeton direct ci-dessous.
pt_br: Ou cole um novo token direto abaixo.
zh_cn: 或在下方粘贴新的直接令牌。
zh_tw: 或在下方貼上新的直接權杖。

# ConnectionPage_RecoveryPairingBullet1
source: Approve this client on the gateway host using the command below.
fr_fr: Approuvez ce client sur l’hôte de la passerelle à l’aide de la commande ci-dessous.
pt_br: Aprove este cliente no host do Gateway usando o comando abaixo.
zh_cn: 使用以下命令在网关主机上批准此客户端。
zh_tw: 使用以下命令在閘道主機上核准此用戶端。

# ConnectionPage_RecoveryPairingBullet2
source: Once approved, click Connect to resume.
fr_fr: Une fois approuvé, cliquez sur Connecter pour reprendre.
pt_br: Depois de aprovado, clique em Conectar para retomar.
zh_cn: 批准后，点击连接以继续。
zh_tw: 核准後，按一下連線以繼續。

# ConnectionPage_RecoveryTunnelBullet1
source: Confirm SSH is reachable on the host.
fr_fr: Confirmez que SSH est accessible sur l’hôte.
pt_br: Confirme se o SSH está acessível no host.
zh_cn: 确认主机上的 SSH 可访问。
zh_tw: 確認主機上的 SSH 可存取。

# ConnectionPage_RecoveryTunnelBullet2
source: Restart the tunnel below if it stopped.
fr_fr: Redémarrez le tunnel ci-dessous s’il s’est arrêté.
pt_br: Reinicie o túnel abaixo se ele tiver parado.
zh_cn: 如果隧道已停止，请在下方重新启动。
zh_tw: 如果通道已停止，請在下方重新啟動。

# ConnectionPage_RecoveryServerBullet1
source: Check the gateway logs on the host.
fr_fr: Vérifiez les journaux de la passerelle sur l’hôte.
pt_br: Verifique os logs do Gateway no host.
zh_cn: 检查主机上的网关日志。
zh_tw: 檢查主機上的閘道記錄。

# ConnectionPage_RecoveryServerBullet2
source: If the gateway is partially up, open its dashboard.
fr_fr: Si la passerelle est partiellement en marche, ouvrez son tableau de bord.
pt_br: Se o Gateway estiver parcialmente ativo, abra o painel dele.
zh_cn: 如果网关部分运行，请打开其仪表板。
zh_tw: 如果閘道部分運作中，請開啟其儀表板。

# ConnectionPage_RecoveryServerBullet3
source: Edit gateway settings to change URL or token.
fr_fr: Modifiez les paramètres de la passerelle pour changer l’URL ou le jeton.
pt_br: Edite as configurações do Gateway para alterar a URL ou o token.
zh_cn: 编辑网关设置以更改 URL 或令牌。
zh_tw: 編輯閘道設定以變更 URL 或權杖。

# ConnectionPage_RecoveryDefaultBullet1
source: Check that the gateway is running on the host.
fr_fr: Vérifiez que la passerelle est en cours d’exécution sur l’hôte.
pt_br: Verifique se o Gateway está em execução no host.
zh_cn: 检查网关是否在主机上运行。
zh_tw: 檢查閘道是否在主機上執行。

# ConnectionPage_RecoveryDefaultBullet2
source: Check that you're on the same network or VPN.
fr_fr: Vérifiez que vous êtes sur le même réseau ou VPN.
pt_br: Verifique se você está na mesma rede ou VPN.
zh_cn: 检查您是否在同一网络或 VPN 上。
zh_tw: 檢查您是否在相同的網路或 VPN 上。

# ConnectionPage_RecoveryDefaultBullet3
source: If using SSH tunnel: confirm it's up.
fr_fr: Si vous utilisez un tunnel SSH : confirmez qu’il est actif.
pt_br: Se estiver usando túnel SSH: confirme se ele está ativo.
zh_cn: 如果使用 SSH 隧道：确认其已启动。
zh_tw: 如果使用 SSH 通道：確認其已啟動。

# ConnectionPage_SshTunnelIsDownText
source: SSH tunnel is down.
fr_fr: Le tunnel SSH est interrompu.
pt_br: O túnel SSH está inativo.
zh_cn: SSH 隧道已断开。
zh_tw: SSH 通道已中斷。

# ConnectionPage_TestingConnection
source: Testing connection…
fr_fr: Test de connexion…
pt_br: Testando conexão…
zh_cn: 正在测试连接…
zh_tw: 正在測試連線…

# ConnectionPage_GatewayReachable
source: Gateway reachable
fr_fr: Passerelle accessible
pt_br: Gateway acessível
zh_cn: 网关可访问
zh_tw: 閘道可存取

# ConnectionPage_GatewayRespondedWith
source: Gateway responded with {0}
fr_fr: La passerelle a répondu avec {0}
pt_br: O Gateway respondeu com {0}
zh_cn: 网关响应代码为 {0}
zh_tw: 閘道回應代碼為 {0}

# ConnectionPage_CannotReachGateway
source: Cannot reach gateway
fr_fr: Impossible d’atteindre la passerelle
pt_br: Não foi possível acessar o Gateway
zh_cn: 无法访问网关
zh_tw: 無法存取閘道

# ConnectionPage_EnterGatewayUrl
source: Enter a gateway URL
fr_fr: Saisissez l’URL de la passerelle
pt_br: Informe uma URL do Gateway
zh_cn: 输入网关 URL
zh_tw: 輸入閘道 URL

# ConnectionPage_Connecting
source: Connecting…
fr_fr: Connexion en cours…
pt_br: Conectando…
zh_cn: 正在连接…
zh_tw: 連線中…

# ConnectionPage_StartingSshTunnel
source: Starting SSH tunnel…
fr_fr: Démarrage du tunnel SSH…
pt_br: Iniciando túnel SSH…
zh_cn: 正在启动 SSH 隧道…
zh_tw: 正在啟動 SSH 通道…

# ConnectionPage_PairingApprovalRequired
source: Pairing approval required for {0}.
fr_fr: Approbation d’appairage requise pour {0}.
pt_br: Aprovação de pareamento necessária para {0}.
zh_cn: 需要对 {0} 进行配对审批。
zh_tw: 需要對 {0} 進行配對核准。

# ConnectionPage_ConnectedTo
source: Connected to {0}.
fr_fr: Connecté à {0}.
pt_br: Conectado a {0}.
zh_cn: 已连接到 {0}。
zh_tw: 已連線到 {0}。

# ConnectionPage_SshServerPortInvalid
source: SSH port must be 1-65535
fr_fr: Le port SSH doit être compris entre 1 et 65535
pt_br: A porta SSH deve estar entre 1 e 65535
zh_cn: SSH 端口必须在 1-65535 之间
zh_tw: SSH 連接埠必須在 1-65535 之間

# ConnectionPage_SshRemotePortInvalid
source: SSH remote port must be 1–65535
fr_fr: Le port distant SSH doit être compris entre 1 et 65535
pt_br: A porta remota SSH deve estar entre 1 e 65535
zh_cn: SSH 远程端口必须在 1–65535 之间
zh_tw: SSH 遠端連接埠必須在 1–65535 之間

# ConnectionPage_SshLocalPortInvalid
source: SSH local port must be 1–65535
fr_fr: Le port local SSH doit être compris entre 1 et 65535
pt_br: A porta local SSH deve estar entre 1 e 65535
zh_cn: SSH 本地端口必须在 1–65535 之间
zh_tw: SSH 本機連接埠必須在 1–65535 之間

# ConnectionPage_TunnelRestartTriggered
source: Tunnel restart triggered.
fr_fr: Redémarrage du tunnel déclenché.
pt_br: Reinício do túnel acionado.
zh_cn: 隧道重启已触发。
zh_tw: 通道重新啟動已觸發。

# ConnectionPage_TunnelRestartFailed
source: Tunnel restart failed: {0}
fr_fr: Échec du redémarrage du tunnel : {0}
pt_br: Falha ao reiniciar o túnel: {0}
zh_cn: 隧道重启失败：{0}
zh_tw: 通道重新啟動失敗：{0}

# ConnectionPage_RepairedReconnecting
source: Re-paired. Reconnecting…
fr_fr: Réappairé. Reconnexion en cours…
pt_br: Repareado. Reconectando…
zh_cn: 已重新配对。正在重新连接…
zh_tw: 已重新配對。重新連線中…

# ConnectionPage_CouldNotApplyCode
source: Could not apply code.
fr_fr: Impossible d’appliquer le code.
pt_br: Não foi possível aplicar o código.
zh_cn: 无法应用代码。
zh_tw: 無法套用代碼。

# ConnectionPage_PleaseEnterSetupCode
source: Please paste a setup code.
fr_fr: Veuillez coller un code de configuration.
pt_br: Cole um código de configuração.
zh_cn: 请粘贴设置代码。
zh_tw: 請貼上設定碼。

# ConnectionPage_Applying
source: Applying…
fr_fr: Application en cours…
pt_br: Aplicando…
zh_cn: 正在应用…
zh_tw: 正在套用…

# ConnectionPage_AppliedGateway
source: Gateway applied: {0}
fr_fr: Passerelle appliquée : {0}
pt_br: Gateway aplicado: {0}
zh_cn: 已应用网关：{0}
zh_tw: 已套用閘道：{0}

# ConnectionPage_InvalidSetupCode
source: Invalid setup code
fr_fr: Code de configuration invalide
pt_br: Código de configuração inválido
zh_cn: 设置代码无效
zh_tw: 設定碼無效

# ConnectionPage_InvalidUrl
source: Invalid URL
fr_fr: URL invalide
pt_br: URL inválida
zh_cn: URL 无效
zh_tw: URL 無效

# ConnectionPage_ConnectionFailed
source: Connection failed
fr_fr: Échec de la connexion
pt_br: Falha na conexão
zh_cn: 连接失败
zh_tw: 連線失敗

# ConnectionPage_UnknownError
source: Unknown error
fr_fr: Erreur inconnue
pt_br: Erro desconhecido
zh_cn: 未知错误
zh_tw: 未知錯誤

# ConnectionPage_PreviewGateway
source: Gateway: {0}
fr_fr: Passerelle : {0}
pt_br: Gateway atual: {0}
zh_cn: 网关：{0}
zh_tw: 閘道：{0}

# ConnectionPage_PreviewGatewayNotSpecified
source: (not specified)
fr_fr: (non spécifié)
pt_br: (não especificado)
zh_cn: （未指定）
zh_tw: （未指定）

# ConnectionPage_PreviewNoToken
source: (no token)
fr_fr: (pas de jeton)
pt_br: (sem token)
zh_cn: （无令牌）
zh_tw: （無權杖）

# ConnectionPage_PreviewToken
source: Token: {0}
fr_fr: Jeton : {0}
pt_br: Token atual: {0}
zh_cn: 令牌：{0}
zh_tw: 權杖：{0}

# ConnectionPage_PressScan
source: Press Start scan to look for gateways on your network.
fr_fr: Appuyez sur Lancer l’analyse pour rechercher des passerelles sur votre réseau.
pt_br: Pressione Iniciar busca para procurar Gateways na sua rede.
zh_cn: 按“开始扫描”以在您的网络上查找网关。
zh_tw: 按下開始掃描以在您的網路上尋找閘道。

# ConnectionPage_ScanningNetwork
source: Scanning your network…
fr_fr: Analyse de votre réseau…
pt_br: Vasculhando sua rede…
zh_cn: 正在扫描您的网络…
zh_tw: 正在掃描您的網路…

# ConnectionPage_NoGatewaysFound
source: No gateways found on your network.
fr_fr: Aucune passerelle trouvée sur votre réseau.
pt_br: Nenhum Gateway encontrado na sua rede.
zh_cn: 未在您的网络上找到网关。
zh_tw: 未在您的網路上找到閘道。

# ConnectionPage_DiscoveredOnNetwork
source: Discovered on your network ({0})
fr_fr: Découverts sur votre réseau ({0})
pt_br: Encontrados na sua rede ({0})
zh_cn: 在您的网络上发现 ({0})
zh_tw: 在您的網路上發現 ({0})

# ConnectionPage_ScanFailed
source: Scan failed: {0}
fr_fr: Échec de l’analyse : {0}
pt_br: Falha ao procurar: {0}
zh_cn: 扫描失败：{0}
zh_tw: 掃描失敗：{0}

# ConnectionPage_Stop
source: Stop
fr_fr: Arrêter
pt_br: Parar
zh_cn: 停止
zh_tw: 停止

# ConnectionPage_ScanAction
source: Scan
fr_fr: Analyser
pt_br: Procurar
zh_cn: 扫描
zh_tw: 掃描

# ConnectionPage_Add
source: Add
fr_fr: Ajouter
pt_br: Adicionar
zh_cn: 添加
zh_tw: 新增

# ConnectionPage_PickDiscoveredGateway
source: Pick a discovered gateway above to connect.
fr_fr: Choisissez une passerelle découverte ci-dessus pour vous connecter.
pt_br: Escolha acima um Gateway encontrado para conectar.
zh_cn: 选择上方发现的网关进行连接。
zh_tw: 選擇上方發現的閘道進行連線。

# ConnectionPage_RemoveGatewayTitle
source: Remove gateway?
fr_fr: Supprimer la passerelle ?
pt_br: Remover Gateway?
zh_cn: 移除网关？
zh_tw: 移除閘道？

# ConnectionPage_RemoveGatewayMessage
source: This will forget {0} and its credentials on this machine.
fr_fr: Cela supprimera {0} et ses identifiants sur cette machine.
pt_br: Isso removerá {0} e suas credenciais deste computador.
zh_cn: 这将移除此计算机上的 {0} 及其凭据。
zh_tw: 這將移除此電腦上的 {0} 及其認證。

# ConnectionPage_CancelAction
source: Cancel
fr_fr: Annuler
pt_br: Cancelar
zh_cn: 取消
zh_tw: 取消

# ConnectionPage_GatewayConnectionFailed
source: Gateway connection failed.
fr_fr: Échec de la connexion à la passerelle.
pt_br: Falha na conexão com o Gateway.
zh_cn: 网关连接失败。
zh_tw: 閘道連線失敗。

# ConnectionPage_ApprovalsSingular
source: 1 approval waiting on you
fr_fr: 1 approbation en attente
pt_br: 1 aprovação aguardando sua decisão
zh_cn: 1 项审批等待您处理
zh_tw: 1 項核准等待您處理

# ConnectionPage_ApprovalsPlural
source: {0} approvals waiting on you
fr_fr: {0} approbations en attente
pt_br: {0} aprovações aguardando sua decisão
zh_cn: {0} 项审批等待您处理
zh_tw: {0} 項核准等待您處理

# ConnectionPage_DeviceLabel
source: Device · {0}
fr_fr: Appareil · {0}
pt_br: Dispositivo · {0}
zh_cn: 设备 · {0}
zh_tw: 裝置 · {0}

# ConnectionPage_NodeLabel
source: Node · {0}
fr_fr: Nœud · {0}
pt_br: Nó · {0}
zh_cn: 节点 · {0}
zh_tw: 節點 · {0}

# ConnectionPage_RepairRequest
source: ⚠️ Repair request
fr_fr: ⚠️ Demande de réparation
pt_br: ⚠️ Solicitação de reparo
zh_cn: ⚠️ 修复请求
zh_tw: ⚠️ 修復請求

# ConnectionPage_Approve
source: Approve
fr_fr: Approuver
pt_br: Aprovar
zh_cn: 批准
zh_tw: 核准

# ConnectionPage_Deny
source: Deny
fr_fr: Refuser
pt_br: Negar
zh_cn: 拒绝
zh_tw: 拒絕

# ConnectionPage_ApprovePairingRequest
source: Approve pairing request
fr_fr: Approuver la demande d’appairage
pt_br: Aprovar solicitação de pareamento
zh_cn: 批准配对请求
zh_tw: 核准配對請求

# ConnectionPage_DenyPairingRequest
source: Deny pairing request
fr_fr: Refuser la demande d’appairage
pt_br: Negar solicitação de pareamento
zh_cn: 拒绝配对请求
zh_tw: 拒絕配對請求

# ConnectionPage_AuthModeBootstrap
source: bootstrap
fr_fr: amorçage
pt_br: inicialização
zh_cn: 引导
zh_tw: 引導

# ConnectionPage_AuthModeSharedToken
source: shared token
fr_fr: jeton partagé
pt_br: token compartilhado
zh_cn: 共享令牌
zh_tw: 共用權杖

# ConnectionPage_AuthModeDeviceToken
source: device token
fr_fr: jeton d’appareil
pt_br: token do dispositivo
zh_cn: 设备令牌
zh_tw: 裝置權杖

# ConnectionPage_UnknownPlatform
source: unknown
fr_fr: inconnu
pt_br: desconhecida
zh_cn: 未知
zh_tw: 未知

# ConnectionPage_ConnectionTimeout
source: Timed out waiting for the gateway connection to complete.
fr_fr: Le délai d’attente de la connexion à la passerelle a expiré.
pt_br: Tempo limite aguardando a conclusão da conexão com o Gateway.
zh_cn: 等待网关连接完成超时。
zh_tw: 等待閘道連線完成逾時。

# ChannelsPage_UnavailableOnWindows
source: This channel requires a macOS host. It can’t be configured from a Windows machine.
fr_fr: Ce canal nécessite un hôte macOS. Il ne peut pas être configuré depuis une machine Windows.
pt_br: Este canal requer um host macOS. Não pode ser configurado a partir de uma máquina Windows.
zh_cn: 此频道需要 macOS 主机，无法从 Windows 计算机进行配置。
zh_tw: 此頻道需要 macOS 主機，無法從 Windows 電腦進行設定。

# ChannelsPage_ReplaceCredentials
source: Replace credentials
fr_fr: Remplacer les identifiants
pt_br: Substituir credenciais
zh_cn: 替换凭据
zh_tw: 替換憑證

# ChannelsPage_Configuration
source: Configuration
fr_fr: Paramètres
pt_br: Configuração
zh_cn: 配置
zh_tw: 設定

# ChannelsPage_CaptionQrLogout
source: Unlink this device from the channel. Scan a fresh QR to reconnect: your account stays paired on your phone.
fr_fr: Dissocier cet appareil du canal. Scannez un nouveau QR pour vous reconnecter: votre compte reste associé sur votre téléphone.
pt_br: Desvincule este dispositivo do canal. Escaneie um novo QR para reconectar: sua conta permanece pareada no seu telefone.
zh_cn: 将此设备与频道取消关联。扫描新的 QR 码以重新连接……您的帐户仍会在手机上保持配对。
zh_tw: 將此裝置與頻道取消連結。掌描新的 QR 碼以重新連線……您的帳戶仍會在手機上保持配對。

# ChannelsPage_CaptionStopLogout
source: Pause the channel temporarily: credentials are kept so you can start it again. Or disconnect entirely to clear them.
fr_fr: Mettre le canal en pause temporairement: les identifiants sont conservés pour pouvoir le redémarrer. Ou déconnectez-vous entièrement pour les effacer.
pt_br: Pause o canal temporariamente: as credenciais são mantidas para que você possa iniciá-lo novamente. Ou desconecte totalmente para apagá-las.
zh_cn: 暂时暂停频道……凭据会被保留，以便您可以重新启动。或完全断开连接以清除凭据。
zh_tw: 暫時暫停頻道……憑證會被保留，以便您可以重新啟動。或完全中斷連線以清除憑證。

# ChannelsPage_CaptionStartLogout
source: Start the channel: it’ll begin handling messages with the stored credentials. Or disconnect entirely to clear them.
fr_fr: Démarrer le canal: il commencera à traiter les messages avec les identifiants enregistrés. Ou déconnectez-vous entièrement pour les effacer.
pt_br: Inicie o canal: ele começará a processar mensagens com as credenciais armazenadas. Ou desconecte totalmente para apagá-las.
zh_cn: 启动频道……它将使用已存储的凭据开始处理消息。或完全断开连接以清除凭据。
zh_tw: 啟動頻道……它將使用已儲存的憑證開始處理訊息。或完全中斷連線以清除憑證。

# ChannelsPage_CaptionStopOnly
source: Pause the channel: credentials are kept so you can start it again.
fr_fr: Mettre le canal en pause: les identifiants sont conservés pour pouvoir le redémarrer.
pt_br: Pause o canal: as credenciais são mantidas para que você possa iniciá-lo novamente.
zh_cn: 暂停频道……凭据会被保留，以便您可以重新启动。
zh_tw: 暫停頻道……憑證會被保留，以便您可以重新啟動。

# ChannelsPage_CaptionStartOnly
source: Start the channel: it’ll begin handling messages with the stored credentials.
fr_fr: Démarrer le canal: il commencera à traiter les messages avec les identifiants enregistrés.
pt_br: Inicie o canal: ele começará a processar mensagens com as credenciais armazenadas.
zh_cn: 启动频道……它将使用已存储的凭据开始处理消息。
zh_tw: 啟動頻道……它將使用已儲存的憑證開始處理訊息。

# ChannelsPage_Start
source: Start
fr_fr: Démarrer
pt_br: Iniciar
zh_cn: 启动
zh_tw: 啟動

# ChannelsPage_Stop
source: Stop
fr_fr: Arrêter
pt_br: Parar
zh_cn: 停止
zh_tw: 停止

# ChannelsPage_Logout
source: Logout
fr_fr: Déconnexion
pt_br: Sair
zh_cn: 注销
zh_tw: 登出

# ChannelsPage_DisconnectForget
source: Disconnect and forget credentials
fr_fr: Déconnecter et oublier les identifiants
pt_br: Desconectar e esquecer credenciais
zh_cn: 断开连接并清除凭据
zh_tw: 中斷連線並清除憑證

# ChannelsPage_Controls
source: Controls
fr_fr: Commandes
pt_br: Controles
zh_cn: 控制
zh_tw: 控制

# ChannelsPage_HelpWhatsApp
source: WhatsApp Linked devices help →
fr_fr: Aide sur les appareils liés WhatsApp →
pt_br: Ajuda sobre dispositivos vinculados do WhatsApp →
zh_cn: WhatsApp 已关联设备帮助 →
zh_tw: WhatsApp 已連結裝置說明 →

# ChannelsPage_HelpSignal
source: Signal Linked devices help →
fr_fr: Aide sur les appareils liés Signal →
pt_br: Ajuda sobre dispositivos vinculados do Signal →
zh_cn: Signal 已关联设备帮助 →
zh_tw: Signal 已連結裝置說明 →

# ChannelsPage_HelpTelegram
source: How to create a Telegram bot →
fr_fr: Comment créer un bot Telegram →
pt_br: Como criar um bot do Telegram →
zh_cn: 如何创建 Telegram 机器人 →
zh_tw: 如何建立 Telegram 機器人 →

# ChannelsPage_HelpDiscord
source: How to create a Discord bot →
fr_fr: Comment créer un bot Discord →
pt_br: Como criar um bot do Discord →
zh_cn: 如何创建 Discord 机器人 →
zh_tw: 如何建立 Discord 機器人 →
